{
    "gifts": [
        {
            "id":13453,
            "date": 1582879859606,
            "order": 1,
            "name":"Турботапки",
            "availableCount": 23,
            "isUnlimited": 0,
            "price": 180,
            "image": "/api_images/tapki/t1.jpg",
            "images": ["/api_images/tapki/t1.jpg", "/api_images/tapki/t2.jpg", "/api_images/tapki/t3.jpg"],
            "isHit": 1,
            "description": "Та́почки (прост. та́пки, тапу́ли ед. ч. та́пка, та́почка, тж. та́пок, та́почек) — вид лёгкой и мягкой домашней обуви. Тапочки обычно изготавливаются из мягкой ткани, кожи и т. п. Обувь подобного покроя известна с древних времён. Некоторые виды, особенно предназначенные для посещения ванны, бассейна и других влажных мест, делаются из резины или пластика. Тапочки могут иметь форму туфли или не иметь задника (шлёпанцы). Подошва у них обычно тонкая и не предоставляет серьёзной защиты для ноги. В гостиницах, банях и т. п. клиентам могут выдаваться так называемые одноразовые тапочки."
        },
        {
            "id":2322345,
            "date": 1582879865412,
            "order": 2,
            "name":"Беседка Нано",
            "availableCount": 0,
            "isUnlimited": 1,
            "price": 1890,
            "image": "/api_images/besedka/b2.jpg",
            "images": ["/api_images/besedka/b2.jpg", "/api_images/besedka/b1.jpg"],
            "isHit": 0,
            "description": "Лёгкое архитектурное сооружение, расположенное, как правило, в саду или парке, со скамейками и столом, предназначенное для защиты от дождя и прямых солнечных лучей и служащее для отдыха и бесед, что и дало ему название."
        },
        {
            "id":34523,
            "date": 1582879868805,
            "order": 3,
            "name":"Беседка для ведения самых важных переговоров",
            "availableCount": 14,
            "isUnlimited": 0,
            "price": 100880,
            "image": "/api_images/besedka/b3.jpg",
            "images": [],
            "isHit": 1,
            "description": "Огромной популярностью пользуются деревянные, каменные, кирпичные, металлические кованые беседки. Беседки из дерева подкупают своей основательностью и естественностью, позволяют наслаждаться запахом и теплотой натурального материала. Кованые беседки могут иметь любую форму и реализовывать самые смелые эстетические замыслы. Они более прочны и долговечны по сравнению с деревянными, при соблюдении технологии защиты металл практически не подвержен отрицательному воздействию атмосферных явлений. Основные материалы для строительства беседки — это дерево, металл и кирпич. Столбы беседки можно сделать из кирпича или камня, могут они быть и бетонными, лишь облицованными камнем. Материалы для строительства беседки должны соответствовать ее стилю."
        },
        {
            "id":45464,
            "date": 1582879863704,
            "order": 4,
            "name":"Секретный товар без картинок и с очень очень очень очень очень очень очень очень очень очень очень длинным названием",
            "availableCount": 0,
            "isUnlimited": 1,
            "price": 10,
            "image": "",
            "images": [],
            "isHit": 0,
            "description": "Ооооо аа ы ээээээ я жжж"
        }
    ],
    "settings": {
        "giftsPerPage": 3
    }
}