<template>
  <transition enter-active-class="animated fadeInUp"
              leave-active-class="animated fadeOutDown">
    <section v-if="gift" class="gift-popup">
      <span class="gift-popup__icon-close">
        <svg viewBox="0 0 24 24"
             width="32px" height="32px" fill="none"
             xmlns="http://www.w3.org/2000/svg"
             @click="closeGift">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M16.3 17.7c.4.4 1 .4 1.4 0 .3-.5.3-1.1 0-1.5L13.3
        12l4.3-4.3c.4-.4.4-1 0-1.4a1 1 0 0 0-1.5 0L12 10.7 7.7 6.3a1 1 0 0 0-1.4 0 1 1 0 0 0 0 1.5l4.3
        4.2-4.3 4.3a1 1 0 0 0 0 1.4c.5.3 1.1.3 1.5 0l4.2-4.3 4.3 4.3z"/>
        </svg>
      </span>
      <div style="overflow: hidden">
        <div class="gift-popup__image"
             :style="imageUrl ? 'background-image: url(' + imageUrl + ')' : ''">
          <template v-if="!gift.image">
            <svg width="189" height="185" viewBox="0 0 189 185"
                 fill="none" xmlns="http://www.w3.org/2000/svg">
              <g opacity="0.3">
                <path d="M12.7722 120C5.72974 120 0 125.73 0 132.772C0
              139.815 5.72974 145.544 12.7722 145.544C19.8146 145.544
              25.5443 139.815 25.5443 132.772C25.5443 125.73 19.8146 120
              12.7722 120ZM12.7722 137.03C10.4248 137.03 8.51478 135.12
              8.51478 132.772C8.51478 130.425 10.4248 128.515 12.7722
              128.515C15.1195 128.515 17.0296 130.425 17.0296 132.772C17.0296
              135.12 15.1195 137.03 12.7722 137.03Z" fill="black" fill-opacity="0.2"/>
              </g>
              <path d="M169.835 153.789H166.915C164.563 153.789 162.657
            155.695 162.657 158.046C162.657 160.397 164.563 162.303 166.915
            162.303H169.835C172.186 162.303 174.092 160.397 174.092 158.046C174.092 155.695
            172.186 153.789 169.835 153.789Z" fill="black" fill-opacity="0.2"/>
              <path d="M149.177 153.789H146.257C143.906 153.789 142 155.695 142 158.046C142
            160.397 143.906 162.303 146.257 162.303H149.177C151.529 162.303 153.435 160.397
            153.435 158.046C153.435 155.695 151.529 153.789 149.177 153.789Z" fill="black" fill-opacity="0.2"/>
              <path d="M158.046 162.657C155.695 162.657 153.789 164.564 153.789 166.915V169.835C153.789
            172.185 155.695 174.092 158.046 174.092C160.397 174.092 162.303 172.185 162.303
            169.835V166.915C162.303 164.563 160.397 162.657 158.046 162.657Z" fill="black" fill-opacity="0.2"/>
              <path d="M158.046 142C155.695 142 153.789 143.907 153.789 146.257V149.177C153.789
            151.528 155.695 153.435 158.046 153.435C160.397 153.435 162.303 151.529 162.303
            149.177V146.257C162.303 143.906 160.397 142 158.046 142Z" fill="black" fill-opacity="0.2"/>
              <path d="M187.267 42.2475C186.475 41.4513 185.377 41 184.257 41C183.138 41 182.04
            41.4513 181.248 42.2475C180.456 43.0395 180 44.1342 180 45.2574C180 46.3772 180.456
            47.471 181.248 48.2672C182.04 49.0588 183.138 49.5148 184.257 49.5148C185.377 49.5148
            186.475 49.0592 187.267 48.2672C188.059 47.471 188.515 46.3768 188.515 45.2574C188.515
            44.1338 188.059 43.0395 187.267 42.2475Z" fill="black" fill-opacity="0.2"/>
              <g opacity="0.3">
                <path d="M171.267 82.2475C170.475 81.4513 169.377 81 168.257 81C167.138 81
              166.04 81.4513 165.248 82.2475C164.456 83.0395 164 84.1342 164 85.2574C164
              86.3772 164.456 87.471 165.248 88.2672C166.04 89.0588 167.138 89.5148 168.257
              89.5148C169.377 89.5148 170.475 89.0592 171.267 88.2672C172.059 87.471 172.515
              86.3768 172.515 85.2574C172.515 84.1338 172.059 83.0395 171.267 82.2475Z"
                      fill="black" fill-opacity="0.2"/>
              </g>
              <g opacity="0.3">
                <path d="M63.2673 164.248C62.4753 163.451 61.3768 163 60.2574 163C59.1376 163
              58.0395 163.451 57.2476 164.248C56.4556 165.039 56 166.134 56 167.257C56 168.377
              56.4556 169.471 57.2476 170.267C58.0395 171.059 59.138 171.515 60.2574 171.515C61.3772
              171.515 62.4753 171.059 63.2673 170.267C64.0592 169.471 64.5148 168.377 64.5148
              167.257C64.5148 166.134 64.0592 165.039 63.2673 164.248Z" fill="black" fill-opacity="0.2"/>
              </g>
              <g filter="url(#filter0_d)">
                <rect x="16" y="13" width="152" height="152" rx="16" fill="white"/>
              </g>
              <path d="M130.189 59.1494H119.628C120.893 57.2061 121.631 54.8904 121.631
            52.4037C121.631 45.5643 116.067 40 109.227 40C104.692 40 100.72 42.4476 98.5565
            46.09C96.7605 44.6568 94.4873 43.7968 92.016 43.7968C89.5447 43.7968 87.2718
            44.6568 85.4755 46.09C83.3122 42.4476 79.3399 40 74.8048 40C67.9653 40 62.401
            45.5643 62.401 52.4037C62.401 54.8898 63.139 57.2056 64.4036 59.1491H53.8431C50.0697
            59.1491 47 62.2188 47 65.9925V75.9538C47 78.48 48.3768 80.6892 50.419 81.8748V128.665C50.419
            134.008 54.7658 138.355 60.109 138.355H123.923C129.266 138.355 133.613 134.008 133.613
            128.665V81.8751C135.655 80.6895 137.032 78.4803 137.032 75.9541V65.9928C137.032 62.2194
            133.962 59.1494 130.189 59.1494ZM102.522 52.404C102.522 48.7064 105.53 45.6985 109.228
            45.6985C112.925 45.6985 115.933 48.7069 115.933 52.4043C115.933 56.1017 112.925 59.1098
            109.228 59.1098H102.522V52.404ZM105.448 64.8476L114.1 80.0951L112.063 79.548C111.332
            79.3525 110.555 79.4543 109.9 79.8324C109.245 80.2105 108.767 80.8334 108.572
            81.5634L108.074 83.4252L97.6242 64.8474H105.448V64.8476ZM92.0166 49.4953C94.6674
            49.4953 96.8238 51.6515 96.8238 54.3023C96.8238 56.9531 94.6674 59.1095 92.0166
            59.1095C89.3658 59.1095 87.2093 56.9531 87.2093 54.3023C87.2093 51.6515 89.3655
            49.4953 92.0166 49.4953ZM86.6677 64.8476L77.9462 80.0897L77.4293 78.1575C77.2339
            77.4272 76.7563 76.8046 76.1015 76.4265C75.4467 76.0487 74.6691 75.9464 73.9385
            76.1421L71.9209 76.6835L78.6714 64.8476H86.6677ZM74.8053 45.6985C78.503 45.6985
            81.5111 48.7066 81.5111 52.404V59.1098H74.8053C71.1077 59.1098 68.0995 56.1014
            68.0995 52.404C68.0995 48.7066 71.1079 45.6985 74.8053 45.6985ZM52.6988
            75.9538V65.9928C52.6988 65.3614 53.2126 64.8476 53.844 64.8476H72.1115L65.1245
            77.0989H53.844C53.2126 77.0989 52.6988 76.5852 52.6988 75.9538ZM97.1446
            132.657H60.109C57.9081 132.657 56.1175 130.866 56.1175 128.665V82.7972H63.7069C63.7405
            82.847 63.7687 82.8992 63.8058 82.9471C64.5082 83.8572 65.689 84.2558 66.7996
            83.958L72.6612 82.3852L74.2295 88.2481C74.5278 89.3636 75.4701 90.1885 76.6147
            90.3373C76.7378 90.3532 76.8606 90.3609 76.9826 90.3609C77.9947 90.3609 78.9427
            89.821 79.4547 88.9271L81.1891 85.8956V114.708C81.1891 116.281 82.4648 117.557
            84.0382 117.557C85.6117 117.557 86.8874 116.281 86.8874
            114.708V82.965H97.1441V132.657H97.1446ZM86.1271 77.2668L92.1508 66.7397L98.0718
            77.2668H86.1271ZM127.915 128.665C127.915 130.866 126.124 132.657 123.923
            132.657H102.843V85.75L106.535 92.3148C107.044 93.2194 107.998 93.7671 109.018
            93.7671C109.136 93.7671 109.255 93.76 109.375 93.7446C110.524 93.5996 111.471
            92.7732 111.771 91.6543L113.339 85.7913L119.201 87.3642C120.31 87.662 121.49
            87.2645 122.193 86.3558C122.896 85.4471 122.984 84.2053 122.417 83.2061L122.185
            82.7969H127.915V128.665ZM131.334 75.9541C131.334 76.5855 130.82 77.0992 130.189
            77.0992H118.951L111.999 64.8479H130.189C130.82 64.8477 131.334 65.3614 131.334
            65.9928V75.9541Z" fill="black" fill-opacity="0.2"/>
              <path d="M27.8341 49.7886H24.9141C22.563 49.7886 20.6567 51.6952 20.6567 54.046C20.6567
            56.3967 22.563 58.3034 24.9141 58.3034H27.8341C30.1853 58.3034 32.0915 56.3971 32.0915
            54.046C32.0915 51.6952 30.1857 49.7886 27.8341 49.7886Z" fill="black" fill-opacity="0.2"/>
              <path d="M7.1774 49.7886H4.25739C1.90622 49.7886 0 51.6952 0 54.046C0 56.3967 1.90622
            58.3034 4.25739 58.3034H7.1774C9.52857 58.3034 11.4348 56.3971 11.4348 54.046C11.4348
            51.6952 9.52899 49.7886 7.1774 49.7886Z" fill="black" fill-opacity="0.2"/>
              <path d="M16.046 58.6572C13.6948 58.6572 11.7886 60.5639 11.7886 62.9146V65.8342C11.7886
            68.1849 13.6948 70.0916 16.046 70.0916C18.3971 70.0916 20.3034 68.1849 20.3034
            65.8342V62.9146C20.3034 60.563 18.3971 58.6572 16.046 58.6572Z" fill="black" fill-opacity="0.2"/>
              <path d="M16.046 38C13.6948 38 11.7886 39.9066 11.7886 42.2574V45.177C11.7886
            47.5277 13.6948 49.4344 16.046 49.4344C18.3971 49.4344 20.3034 47.5277 20.3034
            45.177V42.2574C20.3034 39.9062 18.3971 38 16.046 38Z" fill="black" fill-opacity="0.2"/>
              <path d="M136.772 0C129.73 0 124 5.72974 124 12.7722C124 19.8146 129.73 25.5443
            136.772 25.5443C143.815 25.5443 149.544 19.8146 149.544 12.7722C149.544 5.72974
            143.815 0 136.772 0ZM136.772 17.0296C134.425 17.0296 132.515 15.1195 132.515
            12.7722C132.515 10.4248 134.425 8.51478 136.772 8.51478C139.12 8.51478 141.03
            10.4248 141.03 12.7722C141.03 15.1195 139.12 17.0296 136.772 17.0296Z" fill="black" fill-opacity="0.2"/>
              <defs>
                <filter id="filter0_d" x="0" y="1" width="184" height="184" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                  <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                  <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"/>
                  <feOffset dy="4"/>
                  <feGaussianBlur stdDeviation="8"/>
                  <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.1 0"/>
                  <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow"/>
                  <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow" result="shape"/>
                </filter>
              </defs>
            </svg>
          </template>
          <gift-slider-component v-if="gift.images.length > 0" :gift="gift" />
        </div>
        <div class="gift-popup__labels">
      <span
        v-show="gift.isHit"
        class="app-tag app-tag--orange"
      >Хит!</span>
        </div>
        <div class="gift-popup__title-block">
          <p class="gift-popup__title" v-html="gift.name"></p>
        </div>
        <div class="gift-popup__info-block">
          <p
            class="gift-popup__price"
          >Цена {{ gift.price }} ⍟</p>
          <p
            v-if="!gift.isUnlimited"
            class="gift-popup__count"
          >
            <template v-if="!gift.isUnlimited">
              Остаток {{ gift.availableCount }}
            </template>
          </p>
        </div>
        <div class="gift-popup__description" v-if="gift.description">
          <p ref="giftDescription" :class="isFullDescription ? 'gift-popup__text--full' : 'gift-popup__text'"
             v-html="gift.description">
          </p>
          <p ref="giftFakeDescription" class="gift-popup__fake-description" v-html="gift.description">
          </p>
          <p
            v-if="!isFullDescription && isShowMore"
            class="gift-popup__show-more"
            @click="isFullDescription = !isFullDescription"
          >
            Показать весь текст
          </p>
        </div>
        <div class="gift-popup__button-block">
          <a class="button gift-popup__button-cart"
             @click.prevent="addGift({ giftId: gift.id, amount: 1 })"
          >
            Добавить в корзину
          </a>
        </div>
      </div>
    </section>
  </transition>
</template>

<script>
// import find from 'lodash/find';
import giftSliderComponent from './gift-slider.vue';

export default {
  components: {
    giftSliderComponent,
  },

  props: [
    'gift',
  ],

  data: () => ({
    isFullDescription: false,
    isShowMore: false,
  }),

  computed: {
    imageUrl() {
      return this.gift.image ? this.gift.image : null;
    },
  },

  mounted() {
    if (parseInt(getComputedStyle(this.$refs.giftFakeDescription).height, 10) > 90) this.isShowMore = true;
  },

  methods: {
    // метод генерит в родителя событие "закрыть попап". подключен к клику по иконке закрытия
    closeGift(e) {
      this.$emit('closeGift', e);
    },

    // метод увеличивает счетчик товаров в корзине на 1, подключен к клику по кнопке "добавить в корзину"
    addGift() {
      // eslint-disable-next-line
      alert('Добавлено');
      // addGift({ giftId, amount }) {
      // if (this.canAddMore) {
      //   this.$store.dispatch('giftStore/addGift', { giftId, amount })
      //     .catch((error) => {
      //       this.$store.dispatch('helpers/showNotification', {
      //         message: 'Произошла ошибка',
      //       });

      //       this.closeGift(null);
      //     });
      // } else {
      //   // показываем тост с предупреждением о макс кол-ве
      //   this.$store.dispatch('helpers/showNotification', {
      //     message: 'Добавлено максимальное количество товара',
      //   });
      // }
    },

  },
};
</script>
